In [1]:
import pandas as pd

#### 1. Given a list with numbers 1,2,3,4,5,6. Output the corresponding pandas  series

In [2]:
a= [1,2,3,4,5,6]
a=pd.Series(a)
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

#### 2. Given a list with numbers 1,2,3,4,5,6. Output the corresponding pandas  series with odd indexes only

In [5]:
a= [1,2,3,4,5,6]
a= pd.Series((a),index=[0,3,6,9,11,13])
a

0     1
3     2
6     3
9     4
11    5
13    6
dtype: int64

#### 3. Generate the series of dates from 1st Jan, 2022 to 12th Jan, 2022 (both inclusive)

In [11]:
d = pd.date_range('1/1/2022' ,periods=12)
d

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

#### 4. Apply the function, f(x) = x divide by 2 on each and every element of a given pandas series 2,5,6,7,8,9

In [7]:
a= pd.Series([2,5,6,7,8,9])
s=a.apply(lambda x:x/2)
s

0    1.0
1    2.5
2    3.0
3    3.5
4    4.0
5    4.5
dtype: float64

#### 5. In the given series, filter words that contain atleast 2 vowels from a series? ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [12]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
vo = ser[ser.str.count('(?i)[aeiou]') >=2]
vo

0     Apple
1    Orange
4     Money
dtype: object

#### 6. Given a dictionary having three keys name, age, subjectMarks and dept with 6 values each, convert it into corresponding dataframe and display it

In [14]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
dic

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64
4   Rahul   19     74
5      JJ   23     34

#### 7. Given a dataframe, change the index of a dataframe from the default indexes to a particular column

In [28]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
index1=['a','b','c','d','e','f']
df = pd.DataFrame(dic, index = index1)

df

  Name  Age  Marks
a  NaN  NaN    NaN
b  NaN  NaN    NaN
c  NaN  NaN    NaN
d  NaN  NaN    NaN
e  NaN  NaN    NaN
f  NaN  NaN    NaN

#### 8. Given a dataframe, sort it by age and studentMarks columns

In [15]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
sv= dic.sort_values(by=['Age','Marks'])
sv

     Name  Age  Marks
4   Rahul   19     74
3   Ketan   20     64
2  Ganesh   21     56
1  Sanket   22     90
5      JJ   23     34
0  Nikhil   23     80

#### 9. Given a dataframe with custom indexing, convert it to default indexing and display it

In [16]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
index1=['a','b','c','d','e','f']
df = pd.DataFrame(dic, index = index1)

df.reset_index()

  index Name  Age  Marks
0     a  NaN  NaN    NaN
1     b  NaN  NaN    NaN
2     c  NaN  NaN    NaN
3     d  NaN  NaN    NaN
4     e  NaN  NaN    NaN
5     f  NaN  NaN    NaN

#### 10.Given a dataframe, select the name column and display it using both loc and iloc method

In [32]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
print(dic)
print ("------------loc-------------")
loc = dic.loc[dic["Name"]=='Nikhil']
print(loc)
print ("------------iloc -------------")
iloc = dic.iloc[:4]
print(iloc)

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64
4   Rahul   19     74
5      JJ   23     34
------------loc-------------
     Name  Age  Marks
0  Nikhil   23     80
------------iloc -------------
     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64

#### 11. Given a dataframe, select first 2 rows and output them using both loc and iloc method

In [36]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
iloc = dic.iloc[:2]
iloc

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90

#### 12.Given a dataframe, select all the rows whose age is greater than 20

In [52]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,18],
                   "Marks":[80,90,56,64,74,34]})
loc = dic.loc[dic["Age"]>20]
print(loc)
print ("-------------------------")
sim = dic[dic["Age"]>20]
print(sim)

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
-------------------------
     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56

#### 13.Given a dataframe displaying the average marks of students wrt each department

In [55]:
# groupby Function

dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,18],
                   "Marks":[80,90,56,64,74,34],
                   "Dept":["Analytics","DS","ML","AI","Egn","Maths"]})
group = dic.groupby("Dept")["Marks"].mean()
group

Dept
AI           64.0
Analytics    80.0
DS           90.0
Egn          74.0
ML           56.0
Maths        34.0
Name: Marks, dtype: float64

#### 14.Given a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [74]:
df = pd.DataFrame({"cname":["Tata","Jio","Zomato","Swiggy","Mahindra","Amazone","Google"],
                           "profit":[5,3,4,-1,-8,6,-3]})
print(df)    


df['map_functions'] = df["profit"].apply(lambda x:x>0)
df['map_functions']

      cname  profit
0      Tata       5
1       Jio       3
2    Zomato       4
3    Swiggy      -1
4  Mahindra      -8
5   Amazone       6
6    Google      -3

0     True
1     True
2     True
3    False
4    False
5     True
6    False
Name: map_functions, dtype: bool

#### 15.Write a Pandas program to accept the data in random format. Compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [91]:
import numpy as np
sate  = np.random.RandomState(50)
ran = pd.Series(sate.normal(10,100,4))
result = np.percentile(ran, q=[0, 25, 50, 75, 100])
print("\nMinimum, 25th percentile, median, 75th,  maximum ")
print(result)


# Convert into DF
index1=['Minimum', '25th percentile', 'median', '75th',  'maximum'] 
pd.DataFrame(result,index=index1)

Minimum, 25th percentile, median, 75th,  maximum
[-146.03521087 -138.85233911  -94.27544545  -37.34407188    6.90223965]

                          0
Minimum         -146.035211
25th percentile -138.852339
median           -94.275445
75th             -37.344072
maximum            6.902240

#### 16.Write a Pandas program convert the first and last character of each word to upper case in each word of a given series as follows.Series (['php', 'python', 'java', 'c#'])

In [93]:
pro = pd.Series(['php', 'python', 'java', 'c#'])
print("Original Series:")
print(pro)
result = pro.map(lambda x: x[0].upper() + x[1:-1] + x[-1].upper())
print("\nFirst and last character of each word to upper case:")
print(result)

Original Series:
0       php
1    python
2      java
3        c#
dtype: object

First and last character of each word to upper case:
0       PhP
1    PythoN
2      JavA
3        C#
dtype: object

#### 17.Write a Pandas program to get the day of month, day of year, week number and day of week from a given series of date strings

## Part-2

#### 5. Consider the given below guitar dictionary guitars_dict = { "Fender Telecaster": "Baby Blue", "Gibson Les Paul":"Sunburst", "ESP Eclipse": "Dark Green"}  Assign the resulting Series to a "guitars" variable.

In [10]:
guitars_dict =  { "Fender Telecaster": "Baby Blue",
"Gibson Les Paul":"Sunburst", "ESP Eclipse": "Dark Green"}
aa=pd.Series(guitars_dict)
aa

Fender Telecaster     Baby Blue
Gibson Les Paul        Sunburst
ESP Eclipse          Dark Green
dtype: object

#### 6. Access the value for the index position of 0 within the "guitars" Series.Assign the value to a "fender_color" variable.

#### 7. Access the value for the index label of "Gibson Les Paul" in the "guitars" Series. Assign the value to a "gibson_color" variable.